src_Extension/Reports/МатериальныйОтчетПоВыпуску.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>МатериальныйОтчетПоВыпуску</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладыГП</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоМатериала</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяКалькуляцииМатериала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПродукции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнформацияДляПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src_Extension/AccumulationRegisters/А1_МатСоставИзделий_Расш1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>А1_МатСоставИзделий_Расш1</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПродукцииКонечногоЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМатериала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируемыйРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроизводствоБезЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродукцияКонечногоЭтапа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаПродукцииКонечногоЭтапа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПродукцииКонечногоЭтапа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаМатериала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеМатериала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияМатериала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКалькуляцииМатериала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКоррекции</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоНормам</Name>
					<Comment>Развернуто по нормам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_Extension/Reports/МатериальныйОтчетПоВыпуску/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
		КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	//КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	
	НайденныйПараметр = Неопределено;
    НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
    Если НайденныйПараметрВарианта <> Неопределено Тогда
        НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр = Неопределено тогда
		ВызватьИсключение "Не задан период!";
	КонецЕсли;
	Период = НайденныйПараметр.Значение;
	НайденныйПараметр = Неопределено;
    НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СкладыГП");
    Если НайденныйПараметрВарианта <> Неопределено Тогда
        НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр <> Неопределено тогда
		СкладыГП = НайденныйПараметр.Значение;
	КонецЕсли;     

	ТабМатериалы = МатериалыНаВыпуск(Период.ДатаНачала,Период.ДатаОкончания,СкладыГП);     
		
	ВнешниеНаборыДанных = Новый Структура;                  
	ВнешниеНаборыДанных.Вставить("Материалы", ТабМатериалы);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
 	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// Вывод описания параметров под отчётом
	ВывестиОписаниеПараметров(ДокументРезультат);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиОписаниеПараметров(ДокументРезультат)
	
	ТекстОписания = "
	|
	|Описание параметров отчета
	|==========================
	|
	|Отчет показывает материалы, использованные для выпуска продукции
	|на склады готовой продукции за указанный период.
	|
	|ИСТОЧНИК ДАННЫХ
	|---------------
	|Регистр А1_МатСоставИзделий_Расш1, который заполняется при проведении:
	|  * ЭтапПроизводства2_2 - основной источник (выпуск продукции)
	|  * ПроизводствоБезЗаказа - альтернативный источник выпуска
	|  * ВнутреннееПотребление - сторнирует выпуск при списании продукции на расходы
	|
	|Регистр содержит связь: Продукция - Материалы (какие материалы израсходованы на выпуск).
	|При заполнении регистра полуфабрикаты автоматически разворачиваются до покупных
	|материалов по фактическому расходу, а если факта нет - по нормативному составу.
	|
	|ВАЖНО: Если продукция была списана через Внутреннее потребление (на расходы),
	|в регистре создаются сторно-записи, уменьшающие количество выпуска.
	|
	|ПАРАМЕТРЫ
	|---------
	|ПЕРИОД (обязательный) - диапазон дат для анализа выпуска:
	|  * Фильтрует по дате производства (когда фактически выпущена продукция)
	|
	|СКЛАДЫ ГП - склады готовой продукции:
	|  * Указаны - только выпуск на указанные склады
	|  * Не указано - по умолчанию склад СГП
	|
	|КОЛОНКИ ОТЧЕТА
	|--------------
	|  * Этап - документ этапа производства (регистратор)
	|  * Продукция - номенклатура выпущенной продукции конечного этапа
	|  * Материал - израсходованный материал (развернуто до покупных)
	|  * КоличествоПродукции - количество выпущенной продукции
	|  * КоличествоМатериала - количество израсходованного материала
	|  * СтатьяКалькуляции - статья калькуляции материала
	|  * Подразделение - подразделение-производитель
	|  * Договор - договор из заказа клиента (основание заказа на производство)
	|  * НаправлениеДеятельности - направление деятельности заказа
	|  * ЭтоВП - признак продукции военного назначения (направление входит в группу ВП)
	|  * КоличествоПоВиду - суммарный выпуск по виду номенклатуры за период
	|  * ИНФОГОЗ - сводная информация для печати (код, продукция, договор)
	|
	|Выводятся только записи с положительным количеством продукции и материала.
	|";
	
	// Вывод текста описания построчно
	СтрокиОписания = СтрРазделить(ТекстОписания, Символы.ПС, Ложь);
	Для Каждого СтрокаОписания Из СтрокиОписания Цикл
		МакетСтроки = Новый ТабличныйДокумент;
		ОбластьСтроки = МакетСтроки.ПолучитьОбласть(1, 1, 1, 1);
		ОбластьСтроки.Область(1, 1).Текст = СтрокаОписания;
		ОбластьСтроки.Область(1, 1).ЦветТекста = WebЦвета.Серый;
		ДокументРезультат.Вывести(ОбластьСтроки);
	КонецЦикла;
	
КонецПроцедуры     

&НаСервере
Функция МатериалыНаВыпуск(ДатаНачала, ДатаОкончания, СкладыГП)

	// Параметры по умолчанию
	Если НЕ ЗначениеЗаполнено(СкладыГП) Тогда
		СкладыГП = Новый Массив;
		НайденныйСклад = Справочники.Склады.НайтиПоНаименованию("СГП", Истина);
		Если ЗначениеЗаполнено(НайденныйСклад) Тогда
			СкладыГП.Добавить(НайденныйСклад);
		КонецЕсли;
	КонецЕсли;

	ГруппаВП = Справочники.НаправленияДеятельности.НайтиПоНаименованию("Продукция военного назначения");

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Рег.Регистратор                                              КАК Этап,
	|	Рег.ПродукцияКонечногоЭтапа                                  КАК Продукция,
	|	Рег.ПродукцияКонечногоЭтапа.Код                              КАК ПродукцияКод,
	|	Рег.ПродукцияКонечногоЭтапа.ВидНоменклатуры                  КАК ВидНоменклатуры,
	|	Рег.НазначениеПродукцииКонечногоЭтапа                        КАК НазначениеПродукции,
	|	МАКСИМУМ(Рег.КоличествоПродукцииКонечногоЭтапа)              КАК КоличествоПродукции,
	|	Рег.ХарактеристикаПродукцииКонечногоЭтапа                    КАК ХарактеристикаПродукции,
	|	Рег.Материал                                                 КАК Материал,
	|	СУММА(Рег.КоличествоМатериала)                               КАК КоличествоМатериала,
	|	Рег.СтатьяКалькуляцииМатериала                               КАК СтатьяКалькуляцииМатериала,
	|	Рег.Подразделение                                            КАК Подразделение,
	|	Рег.Договор                                                  КАК Договор,
	|	Рег.НаправлениеДеятельности                                  КАК НаправлениеДеятельности,
	|	ВЫРАЗИТЬ(Рег.ИнформацияДляПечати КАК СТРОКА(250))            КАК ИнформацияДляПечати,
	|	ЕСТЬNULL(ВЫБОР КОГДА Рег.НаправлениеДеятельности.Родитель = &ГруппаВП ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ, ЛОЖЬ) КАК ЭтоВП,
	|	ЕСТЬNULL(МАКСИМУМ(СуммыВыпускаПоВН.КоличествоПродукцииВида), 0) КАК КоличествоПоВиду
	|ИЗ
	|	РегистрНакопления.А1_МатСоставИзделий_Расш1 КАК Рег
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|		ВЫБРАТЬ
	|			ВыходныеИзделия.Номенклатура.ВидНоменклатуры      КАК ВидНоменклатуры,
	|			СУММА(ВыходныеИзделия.Количество)                 КАК КоличествоПродукцииВида
	|		ИЗ
	|			Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ВыходныеИзделия
	|		ГДЕ
	|			ВыходныеИзделия.ДатаПроизводства МЕЖДУ &Дата0 И &Дата1
	|			И ВыходныеИзделия.Произведено
	|			И ВЫРАЗИТЬ(ВыходныеИзделия.Получатель КАК Справочник.Склады) ЕСТЬ НЕ NULL
	|			И ВЫРАЗИТЬ(ВыходныеИзделия.Получатель КАК Справочник.Склады) В(&СкладыГП)
	|			И ВыходныеИзделия.Ссылка.Проведен
	|		СГРУППИРОВАТЬ ПО
	|			ВыходныеИзделия.Номенклатура.ВидНоменклатуры
	|	) КАК СуммыВыпускаПоВН
	|	ПО	СуммыВыпускаПоВН.ВидНоменклатуры = Рег.ПродукцияКонечногоЭтапа.ВидНоменклатуры
	|
	|ГДЕ
	|	Рег.СкладПолучатель В(&СкладыГП)
	|	И Рег.ДатаПроизводства МЕЖДУ &Дата0 И &Дата1
	|	И Рег.Активность
	|	И (НЕ Рег.Сторно ИЛИ Рег.КорректируемыйРегистратор = Рег.Регистратор)      
	|
	|СГРУППИРОВАТЬ ПО 
	|	Рег.Регистратор,
	|	Рег.ПродукцияКонечногоЭтапа,
	|	Рег.ПродукцияКонечногоЭтапа.Код,
	|	Рег.НазначениеПродукцииКонечногоЭтапа,
	|	Рег.ХарактеристикаПродукцииКонечногоЭтапа,
	|	Рег.Материал,
	|	Рег.СтатьяКалькуляцииМатериала,
	|	Рег.Подразделение,
	|	Рег.Договор,
	|	Рег.НаправлениеДеятельности,
	|	ВЫРАЗИТЬ(Рег.ИнформацияДляПечати КАК СТРОКА(250))
	|
	|ИМЕЮЩИЕ
	|	СУММА(Рег.КоличествоПродукцииКонечногоЭтапа) > 0
	|	И СУММА(Рег.КоличествоМатериала) > 0"
	);

	Запрос.УстановитьПараметр("Дата0", ДатаНачала);
	Запрос.УстановитьПараметр("Дата1", ДатаОкончания);
	Запрос.УстановитьПараметр("СкладыГП", СкладыГП);
	Запрос.УстановитьПараметр("ГруппаВП", ГруппаВП);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	// Таблица результата
	ТаблицаМатериалов = Новый ТаблицаЗначений;
	ТаблицаМатериалов.Колонки.Добавить("Этап");
	ТаблицаМатериалов.Колонки.Добавить("Продукция");
	ТаблицаМатериалов.Колонки.Добавить("НазначениеПродукции");
	ТаблицаМатериалов.Колонки.Добавить("КоличествоПродукции");
	ТаблицаМатериалов.Колонки.Добавить("ХарактеристикаПродукции");
	ТаблицаМатериалов.Колонки.Добавить("Материал");
	ТаблицаМатериалов.Колонки.Добавить("КоличествоМатериала");
	ТаблицаМатериалов.Колонки.Добавить("СтатьяКалькуляцииМатериала");
	ТаблицаМатериалов.Колонки.Добавить("Подразделение");
	ТаблицаМатериалов.Колонки.Добавить("Договор");
	ТаблицаМатериалов.Колонки.Добавить("НаправлениеДеятельности");
	ТаблицаМатериалов.Колонки.Добавить("ИнформацияДляПечати");
	ТаблицаМатериалов.Колонки.Добавить("ИНФОГОЗ");
	ТаблицаМатериалов.Колонки.Добавить("ВидНоменклатуры");
	ТаблицаМатериалов.Колонки.Добавить("КоличествоПоВиду");
	ТаблицаМатериалов.Колонки.Добавить("ЭтоВП");

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаМатериалов.Добавить();
		НоваяСтрока.Этап                       = Выборка.Этап;
		НоваяСтрока.Продукция                  = Выборка.Продукция;
		НоваяСтрока.НазначениеПродукции        = Выборка.НазначениеПродукции;
		НоваяСтрока.КоличествоПродукции        = Выборка.КоличествоПродукции;
		НоваяСтрока.ХарактеристикаПродукции    = Выборка.ХарактеристикаПродукции;
		НоваяСтрока.Материал                   = Выборка.Материал;
		НоваяСтрока.КоличествоМатериала        = Выборка.КоличествоМатериала;
		НоваяСтрока.СтатьяКалькуляцииМатериала = Выборка.СтатьяКалькуляцииМатериала;
		НоваяСтрока.Подразделение              = Выборка.Подразделение;
		НоваяСтрока.Договор                    = Выборка.Договор;
		НоваяСтрока.НаправлениеДеятельности    = Выборка.НаправлениеДеятельности;
		НоваяСтрока.ИнформацияДляПечати        = Выборка.ИнформацияДляПечати;
		НоваяСтрока.ВидНоменклатуры            = Выборка.ВидНоменклатуры;
		НоваяСтрока.КоличествоПоВиду           = Выборка.КоличествоПоВиду;
		НоваяСтрока.ИНФОГОЗ =
			СТРОКА(Выборка.ПродукцияКод + " " + Выборка.Продукция + " - " + Выборка.КоличествоПродукции + " шт" + Символы.ПС +
			Выборка.Договор + " " + Выборка.НаправлениеДеятельности + Символы.ПС +
			Выборка.ИнформацияДляПечати);
		НоваяСтрока.ЭтоВП = Выборка.ЭтоВП;
	КонецЦикла;

	Возврат ТаблицаМатериалов;

КонецФункции
